app/services/freight_service.rb

  def self.calculation_cubage(uf, generator_id)
    freight_tips = {}
    generator = PowerGenerator.find(generator_id.to_i)
    freight_finds = Freight.where(state: uf).select(:weight_max, :weight_min, :cost)
    if generator.present? && freight_finds.present?
---
SELECT  "power_generators".* FROM "power_generators" WHERE "power_generators"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "freights"."weight_max", "freights"."weight_min", "freights"."cost" FROM "freights" WHERE "freights"."state" = $1  [["state", "RO"]]