app/services/recomends_service.rb

  def self.generator_recomends(data)
    response = []
    generator_finds = PowerGenerator.all.select(
      :id,
      :name,
      :description,
      :manufacturer,
      :structure_type,
      :price, :height,
      :width, :lenght,
      :weight,
      :kwp
    )
---
SELECT "power_generators"."id", "power_generators"."name", "power_generators"."description", "power_generators"."manufacturer", "power_generators"."structure_type", "power_generators"."price", "power_generators"."height", "power_generators"."width", "power_generators"."lenght", "power_generators"."weight", "power_generators"."kwp" FROM "power_generators"