app/controllers/freights_controller.rb

SELECT  "power_generators".* FROM "power_generators" WHERE "power_generators"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT  "freights".* FROM "freights" WHERE "freights"."state" = $1 LIMIT $2  [["state", "RO"], ["LIMIT", 11]]
---
  def find_cep_and_calculate
    byebug
    address = Correios::CEP::AddressFinder.get(params[:cep])
    byebug
    generator = PowerGenerator.find(params[:generator_id])
    freight_find = Freight.where(state: address.state)