app/controllers/power_generators_controller.rb

  def consult_generator
    generator = PowerGenerator.find(params[:id])
---
SELECT  "power_generators".* FROM "power_generators" WHERE "power_generators"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]