app/controllers/power_generators_controller.rb

  def index
    @q = PowerGenerator.ransack(params[:q])
    if @q.sorts.present?
      @power_generators = @q.result.page(params[:page]).per(6)
    else
    @power_generators = @q.result.page(params[:page])
---
SELECT "power_generators".* FROM "power_generators"
SELECT COUNT(*) FROM "power_generators"
SELECT  "power_generators".* FROM "power_generators" LIMIT $1  [["LIMIT", 11]]